{"format": "layers-model", "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.0.1", "modelTopology": {"keras_version": "2.2.4", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_6", "layers": [{"name": "input_6", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 900, 1], "dtype": "float32", "sparse": false, "name": "input_6"}, "inbound_nodes": []}, {"name": "model_2", "class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 900, 1], "dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": []}, {"name": "conv1d_32", "class_name": "Conv1D", "config": {"name": "conv1d_32", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.05, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "conv1d_33", "class_name": "Conv1D", "config": {"name": "conv1d_33", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.05, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["conv1d_32", 0, 0, {}]]]}, {"name": "conv1d_34", "class_name": "Conv1D", "config": {"name": "conv1d_34", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.05, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["conv1d_33", 0, 0, {}]]]}, {"name": "add_11", "class_name": "Add", "config": {"name": "add_11", "trainable": true}, "inbound_nodes": [[["conv1d_34", 0, 0, {}], ["input_2", 0, 0, {}]]]}, {"name": "activation_11", "class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_11", 0, 0, {}]]]}, {"name": "conv1d_35", "class_name": "Conv1D", "config": {"name": "conv1d_35", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.05, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"name": "conv1d_36", "class_name": "Conv1D", "config": {"name": "conv1d_36", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.05, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["conv1d_35", 0, 0, {}]]]}, {"name": "conv1d_37", "class_name": "Conv1D", "config": {"name": "conv1d_37", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.05, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["conv1d_36", 0, 0, {}]]]}, {"name": "add_12", "class_name": "Add", "config": {"name": "add_12", "trainable": true}, "inbound_nodes": [[["conv1d_37", 0, 0, {}], ["activation_11", 0, 0, {}]]]}, {"name": "activation_12", "class_name": "Activation", "config": {"name": "activation_12", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_12", 0, 0, {}]]]}, {"name": "conv1d_38", "class_name": "Conv1D", "config": {"name": "conv1d_38", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.05, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"name": "conv1d_39", "class_name": "Conv1D", "config": {"name": "conv1d_39", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.05, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["conv1d_38", 0, 0, {}]]]}, {"name": "conv1d_40", "class_name": "Conv1D", "config": {"name": "conv1d_40", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.05, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["conv1d_39", 0, 0, {}]]]}, {"name": "add_13", "class_name": "Add", "config": {"name": "add_13", "trainable": true}, "inbound_nodes": [[["conv1d_40", 0, 0, {}], ["activation_12", 0, 0, {}]]]}, {"name": "activation_13", "class_name": "Activation", "config": {"name": "activation_13", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_13", 0, 0, {}]]]}, {"name": "conv1d_41", "class_name": "Conv1D", "config": {"name": "conv1d_41", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.05, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"name": "conv1d_42", "class_name": "Conv1D", "config": {"name": "conv1d_42", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.05, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["conv1d_41", 0, 0, {}]]]}, {"name": "conv1d_43", "class_name": "Conv1D", "config": {"name": "conv1d_43", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.05, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["conv1d_42", 0, 0, {}]]]}, {"name": "add_14", "class_name": "Add", "config": {"name": "add_14", "trainable": true}, "inbound_nodes": [[["conv1d_43", 0, 0, {}], ["activation_13", 0, 0, {}]]]}, {"name": "activation_14", "class_name": "Activation", "config": {"name": "activation_14", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_14", 0, 0, {}]]]}, {"name": "conv1d_44", "class_name": "Conv1D", "config": {"name": "conv1d_44", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.05, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"name": "conv1d_45", "class_name": "Conv1D", "config": {"name": "conv1d_45", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.05, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["conv1d_44", 0, 0, {}]]]}, {"name": "conv1d_46", "class_name": "Conv1D", "config": {"name": "conv1d_46", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.05, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["conv1d_45", 0, 0, {}]]]}, {"name": "add_15", "class_name": "Add", "config": {"name": "add_15", "trainable": true}, "inbound_nodes": [[["conv1d_46", 0, 0, {}], ["activation_14", 0, 0, {}]]]}, {"name": "activation_15", "class_name": "Activation", "config": {"name": "activation_15", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_15", 0, 0, {}]]]}, {"name": "conv1d_47", "class_name": "Conv1D", "config": {"name": "conv1d_47", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.05, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["activation_15", 0, 0, {}]]]}, {"name": "conv1d_48", "class_name": "Conv1D", "config": {"name": "conv1d_48", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.05, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["conv1d_47", 0, 0, {}]]]}, {"name": "conv1d_49", "class_name": "Conv1D", "config": {"name": "conv1d_49", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.05, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["conv1d_48", 0, 0, {}]]]}, {"name": "add_16", "class_name": "Add", "config": {"name": "add_16", "trainable": true}, "inbound_nodes": [[["conv1d_49", 0, 0, {}], ["activation_15", 0, 0, {}]]]}, {"name": "activation_16", "class_name": "Activation", "config": {"name": "activation_16", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_16", 0, 0, {}]]]}, {"name": "conv1d_50", "class_name": "Conv1D", "config": {"name": "conv1d_50", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.05, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"name": "conv1d_51", "class_name": "Conv1D", "config": {"name": "conv1d_51", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.05, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["conv1d_50", 0, 0, {}]]]}, {"name": "conv1d_52", "class_name": "Conv1D", "config": {"name": "conv1d_52", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.05, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["conv1d_51", 0, 0, {}]]]}, {"name": "add_17", "class_name": "Add", "config": {"name": "add_17", "trainable": true}, "inbound_nodes": [[["conv1d_52", 0, 0, {}], ["activation_16", 0, 0, {}]]]}, {"name": "activation_17", "class_name": "Activation", "config": {"name": "activation_17", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_17", 0, 0, {}]]]}, {"name": "conv1d_53", "class_name": "Conv1D", "config": {"name": "conv1d_53", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.05, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"name": "conv1d_54", "class_name": "Conv1D", "config": {"name": "conv1d_54", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.05, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["conv1d_53", 0, 0, {}]]]}, {"name": "conv1d_55", "class_name": "Conv1D", "config": {"name": "conv1d_55", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.05, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["conv1d_54", 0, 0, {}]]]}, {"name": "add_18", "class_name": "Add", "config": {"name": "add_18", "trainable": true}, "inbound_nodes": [[["conv1d_55", 0, 0, {}], ["activation_17", 0, 0, {}]]]}, {"name": "activation_18", "class_name": "Activation", "config": {"name": "activation_18", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_18", 0, 0, {}]]]}, {"name": "conv1d_56", "class_name": "Conv1D", "config": {"name": "conv1d_56", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.05, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["activation_18", 0, 0, {}]]]}, {"name": "conv1d_57", "class_name": "Conv1D", "config": {"name": "conv1d_57", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.05, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["conv1d_56", 0, 0, {}]]]}, {"name": "conv1d_58", "class_name": "Conv1D", "config": {"name": "conv1d_58", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.05, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["conv1d_57", 0, 0, {}]]]}, {"name": "add_19", "class_name": "Add", "config": {"name": "add_19", "trainable": true}, "inbound_nodes": [[["conv1d_58", 0, 0, {}], ["activation_18", 0, 0, {}]]]}, {"name": "activation_19", "class_name": "Activation", "config": {"name": "activation_19", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_19", 0, 0, {}]]]}, {"name": "conv1d_59", "class_name": "Conv1D", "config": {"name": "conv1d_59", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.05, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["activation_19", 0, 0, {}]]]}, {"name": "conv1d_60", "class_name": "Conv1D", "config": {"name": "conv1d_60", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.05, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["conv1d_59", 0, 0, {}]]]}, {"name": "conv1d_61", "class_name": "Conv1D", "config": {"name": "conv1d_61", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.05, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["conv1d_60", 0, 0, {}]]]}, {"name": "add_20", "class_name": "Add", "config": {"name": "add_20", "trainable": true}, "inbound_nodes": [[["conv1d_61", 0, 0, {}], ["activation_19", 0, 0, {}]]]}, {"name": "activation_20", "class_name": "Activation", "config": {"name": "activation_20", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_20", 0, 0, {}]]]}, {"name": "conv1d_62", "class_name": "Conv1D", "config": {"name": "conv1d_62", "trainable": true, "filters": 1, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.05, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["activation_20", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0]], "output_layers": [["conv1d_62", 0, 0]]}, "inbound_nodes": [[["input_6", 0, 0, {}]], [["input_6", 0, 0, {}]], [["input_6", 0, 0, {}]]]}, {"name": "model_4", "class_name": "Model", "config": {"name": "model_4", "layers": [{"name": "input_4", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 900, 1], "dtype": "float32", "sparse": false, "name": "input_4"}, "inbound_nodes": []}, {"name": "conv1d_73", "class_name": "Conv1D", "config": {"name": "conv1d_73", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.09, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["input_4", 0, 0, {}]]]}, {"name": "conv1d_74", "class_name": "Conv1D", "config": {"name": "conv1d_74", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.09, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["conv1d_73", 0, 0, {}]]]}, {"name": "conv1d_75", "class_name": "Conv1D", "config": {"name": "conv1d_75", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.09, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["conv1d_74", 0, 0, {}]]]}, {"name": "add_24", "class_name": "Add", "config": {"name": "add_24", "trainable": true}, "inbound_nodes": [[["conv1d_75", 0, 0, {}], ["input_4", 0, 0, {}]]]}, {"name": "activation_24", "class_name": "Activation", "config": {"name": "activation_24", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_24", 0, 0, {}]]]}, {"name": "conv1d_76", "class_name": "Conv1D", "config": {"name": "conv1d_76", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.09, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"name": "conv1d_77", "class_name": "Conv1D", "config": {"name": "conv1d_77", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.09, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["conv1d_76", 0, 0, {}]]]}, {"name": "conv1d_78", "class_name": "Conv1D", "config": {"name": "conv1d_78", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.09, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["conv1d_77", 0, 0, {}]]]}, {"name": "add_25", "class_name": "Add", "config": {"name": "add_25", "trainable": true}, "inbound_nodes": [[["conv1d_78", 0, 0, {}], ["activation_24", 0, 0, {}]]]}, {"name": "activation_25", "class_name": "Activation", "config": {"name": "activation_25", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_25", 0, 0, {}]]]}, {"name": "conv1d_79", "class_name": "Conv1D", "config": {"name": "conv1d_79", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.09, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["activation_25", 0, 0, {}]]]}, {"name": "conv1d_80", "class_name": "Conv1D", "config": {"name": "conv1d_80", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.09, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["conv1d_79", 0, 0, {}]]]}, {"name": "conv1d_81", "class_name": "Conv1D", "config": {"name": "conv1d_81", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.09, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["conv1d_80", 0, 0, {}]]]}, {"name": "add_26", "class_name": "Add", "config": {"name": "add_26", "trainable": true}, "inbound_nodes": [[["conv1d_81", 0, 0, {}], ["activation_25", 0, 0, {}]]]}, {"name": "activation_26", "class_name": "Activation", "config": {"name": "activation_26", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_26", 0, 0, {}]]]}, {"name": "conv1d_82", "class_name": "Conv1D", "config": {"name": "conv1d_82", "trainable": true, "filters": 1, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.09, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["activation_26", 0, 0, {}]]]}, {"name": "reshape_2", "class_name": "Reshape", "config": {"name": "reshape_2", "trainable": true, "target_shape": [900]}, "inbound_nodes": [[["conv1d_82", 0, 0, {}]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "units": 80, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape_2", 0, 0, {}]]]}, {"name": "dense_5", "class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "units": 30, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"name": "dense_6", "class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_5", 0, 0, {}]]]}], "input_layers": [["input_4", 0, 0]], "output_layers": [["dense_6", 0, 0]]}, "inbound_nodes": [[["input_6", 0, 0, {}]]]}, {"name": "model_3", "class_name": "Model", "config": {"name": "model_3", "layers": [{"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 900, 1], "dtype": "float32", "sparse": false, "name": "input_3"}, "inbound_nodes": []}, {"name": "conv1d_63", "class_name": "Conv1D", "config": {"name": "conv1d_63", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.09, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "conv1d_64", "class_name": "Conv1D", "config": {"name": "conv1d_64", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.09, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["conv1d_63", 0, 0, {}]]]}, {"name": "conv1d_65", "class_name": "Conv1D", "config": {"name": "conv1d_65", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.09, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["conv1d_64", 0, 0, {}]]]}, {"name": "add_21", "class_name": "Add", "config": {"name": "add_21", "trainable": true}, "inbound_nodes": [[["conv1d_65", 0, 0, {}], ["input_3", 0, 0, {}]]]}, {"name": "activation_21", "class_name": "Activation", "config": {"name": "activation_21", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_21", 0, 0, {}]]]}, {"name": "conv1d_66", "class_name": "Conv1D", "config": {"name": "conv1d_66", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.09, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"name": "conv1d_67", "class_name": "Conv1D", "config": {"name": "conv1d_67", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.09, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["conv1d_66", 0, 0, {}]]]}, {"name": "conv1d_68", "class_name": "Conv1D", "config": {"name": "conv1d_68", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.09, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["conv1d_67", 0, 0, {}]]]}, {"name": "add_22", "class_name": "Add", "config": {"name": "add_22", "trainable": true}, "inbound_nodes": [[["conv1d_68", 0, 0, {}], ["activation_21", 0, 0, {}]]]}, {"name": "activation_22", "class_name": "Activation", "config": {"name": "activation_22", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_22", 0, 0, {}]]]}, {"name": "conv1d_69", "class_name": "Conv1D", "config": {"name": "conv1d_69", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.09, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["activation_22", 0, 0, {}]]]}, {"name": "conv1d_70", "class_name": "Conv1D", "config": {"name": "conv1d_70", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.09, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["conv1d_69", 0, 0, {}]]]}, {"name": "conv1d_71", "class_name": "Conv1D", "config": {"name": "conv1d_71", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.09, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["conv1d_70", 0, 0, {}]]]}, {"name": "add_23", "class_name": "Add", "config": {"name": "add_23", "trainable": true}, "inbound_nodes": [[["conv1d_71", 0, 0, {}], ["activation_22", 0, 0, {}]]]}, {"name": "activation_23", "class_name": "Activation", "config": {"name": "activation_23", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_23", 0, 0, {}]]]}, {"name": "conv1d_72", "class_name": "Conv1D", "config": {"name": "conv1d_72", "trainable": true, "filters": 1, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.09, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"name": "reshape_1", "class_name": "Reshape", "config": {"name": "reshape_1", "trainable": true, "target_shape": [900]}, "inbound_nodes": [[["conv1d_72", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 80, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 30, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}], "input_layers": [["input_3", 0, 0]], "output_layers": [["dense_3", 0, 0]]}, "inbound_nodes": [[["model_2", 1, 0, {}]]]}, {"name": "model_1", "class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 900, 1], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "conv1d_1", "class_name": "Conv1D", "config": {"name": "conv1d_1", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": {"class_name": "MinMaxNorm", "config": {"min_value": 0, "max_value": 0.05, "rate": 1.0, "axis": 0}}, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv1d_2", "class_name": "Conv1D", "config": {"name": "conv1d_2", "trainable": true, "filters": 32, "kernel_size": [3], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, 